// !!! ПЕРЕД РАБОТОЙ С ЭТИМ ФАЙЛОМ НЕ ЗАБЫТЬ ПОДКЛЮЧИТЬ ЕГО В INDEX

// ---- MACCИВ

// -----------------------------
// CОЗДАНИЕ МАССИВА

// массив можно создать двумя способами
let myArrey = [];
// и
let myArrey1 = Array("Cливв")



// -----------------------------
// ДОБАВЛЕНИЕ ЗНАЧЕНИЙ В !КОНЕЦ! МАССИВA C ПОМОЩЬЮ МЕТОДА push() 

myArrey.push(38,49,52)

// потом раскомментировать
console.log(myArrey)


// Слияние двух массивов происходит с помощью нижнего метода, добовляеммый массив добавляется в конец

// потом раскомментировать
// Array.prototype.push.apply(myArrey,myArrey1)

// потом раскомментировать
console.log(myArrey)